In [15]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [16]:
df = pd.read_csv('CardioGoodFitness.csv')
df.head()

  Product  Age  Gender  Education MaritalStatus  Usage  Fitness  Income  Miles
0   TM195   18    Male         14        Single      3        4   29562    112
1   TM195   19    Male         15        Single      2        3   31836     75
2   TM195   19  Female         14     Partnered      4        3   30699     66
3   TM195   19    Male         12        Single      3        3   32973     85
4   TM195   20    Male         13     Partnered      4        2   35247     47

In [17]:
df.shape

(180, 9)

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 180 entries, 0 to 179
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Product        180 non-null    object
 1   Age            180 non-null    int64
 2   Gender         180 non-null    object
 3   Education      180 non-null    int64
 4   MaritalStatus  180 non-null    object
 5   Usage          180 non-null    int64
 6   Fitness        180 non-null    int64
 7   Income         180 non-null    int64
 8   Miles          180 non-null    int64
dtypes: int64(6), object(3)
memory usage: 12.8+ KB

In [19]:
df.describe()

,Age,Education,Usage,Fitness,Income,Miles
count,180.000000,180.000000,180.000000,180.000000,180.000000,180.000000
mean,28.788889,15.572222,3.455556,3.311111,53719.577778,103.194444
std,6.943498,1.617055,1.084797,0.958869,16506.684226,51.863605
min,18.000000,12.000000,2.000000,1.000000,29562.000000,21.000000
25%,24.000000,14.000000,3.000000,3.000000,44058.750000,66.000000
50%,26.000000,16.000000,3.000000,3.000000,50596.500000,94.000000
75%,33.000000,16.000000,4.000000,4.000000,58668.000000,114.750000
max,50.000000,21.000000,7.000000,5.000000,104581.000000,360.000000

In [20]:
products = df['Product'].unique()
products

array(['TM195', 'TM498', 'TM798'], dtype=object)

In [22]:
categoricalObject = df.select_dtypes(include=["object"]).columns
for attribute in categoricalObject:
    #print(attribute)
    df[attribute] = pd.Categorical(df[attribute])
#df['Product'] = pd.Categorical(df['Product'])

Product
Gender
MaritalStatus

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 180 entries, 0 to 179
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Product        180 non-null    category
 1   Age            180 non-null    int64
 2   Gender         180 non-null    category
 3   Education      180 non-null    int64
 4   MaritalStatus  180 non-null    category
 5   Usage          180 non-null    int64
 6   Fitness        180 non-null    int64
 7   Income         180 non-null    int64
 8   Miles          180 non-null    int64
dtypes: category(3), int64(6)
memory usage: 9.5 KB

In [25]:
for attribute in categoricalObject:
    print(df[attribute].unique())

['TM195', 'TM498', 'TM798']
Categories (3, object): ['TM195', 'TM498', 'TM798']
['Male', 'Female']
Categories (2, object): ['Female', 'Male']
['Single', 'Partnered']
Categories (2, object): ['Partnered', 'Single']

* There are total 3 products 'TM195', 'TM498', 'TM798'
* Minimum age is 18 and max age is 50
* Single and Married both type of people use machines
* Male and Female both use machine

In [26]:
df.isnull().sum()

Product          0
Age              0
Gender           0
Education        0
MaritalStatus    0
Usage            0
Fitness          0
Income           0
Miles            0
dtype: int64

* No missing values

In [ ]:
def histogram_boxplot(data, feature, figsize=(12,7), kde=False, bins=None):
    print('i m here')
    fig, (ax_box, ax_hist) = plt.subplots(nrows=2, sharex= True, gridspec_kw={"height_ratios":(0.25,0.75)}, figsize=figsize)
    sns.boxplot(data=data, x= feature, ax= ax_box, showmeans=True)
    sns.histplot(data=data, x=feature, ax=ax_hist, bins=bins, kde=kde) if bins else sns.histplot(data=data, x=feature, ax=ax_hist)
    ax_hist.axvline(data[feature].mean(), color="green", linestyle="--")
    ax_hist.axvline(data[feature].median(), color="black", linestyle="-")

In [ ]:
histogram_boxplot(df, 'Age')

In [31]:
np.pi

3.141592653589793